# -*- coding:utf-8 -*-
class MagicIndex:
    # 每一次牵扯到两次递归
    # 如何才能产生两次return，方法：利用判断，最终的函数返回时再返回bool类型，中间返回int，以用于进行判断

    # 允许出现重复值，那么当mid>a[mid]时，左边可以出现魔术索引，但是下标肯定<=a[mid]
    # 当mid > a[mid]时，右边可以出现魔术索引，但是下标肯定>=a[mid]
    def bSearch(self, a, left, right):
        if (left > right or left < 0 or right >= len(a)):
            return False

        mid = (left + right) // 2
        a_mid=a[mid]
        if mid == a[mid]:
            return True

        elif mid > a[mid]:  #
            # 查左边
            another_right = a[mid]
            result_mid = self.bSearch(a, left, another_right)
            if result_mid > 0:
                return True
            # 查右边
            else:
                left = mid + 1
                return self.bSearch(a, left, right)

        else:
            # 查右边
            another_left = a[mid]
            result_mid = self.bSearch(a, another_left, right)
            if result_mid is True:
                return True
            # 往左边找
            right = mid - 1
            return self.bSearch(a, left, right)  # 这里要记得写上return，不然无法将True返回


    def findMagicIndex(self, A, n):
        return self.bSearch(A, 0, len(A) - 1)       #错在了这里，内层的函数返回了，外层的函数却没有返回

if __name__ == "__main__":
    upstairs = MagicIndex()
    m = [0,1,2,4,6,6,7,7,7,9,10,11,11,11,12,14,15,16,18,18,20,22,22,22,23,24,24,24,24,24,24,24,26,28,30,30,30,31,31,31,33,35,36,38,40,42,43,44,46,48,48,48,49,51,53,53,55,57,57,59,61,62,64,65,65,66,66,67,69,69,69,71,71,73,75,75,76,78,80,82,82,84,85,86,86,87,87,87,88,88,89,89,90,92,93,95,95,96,98,98,99,101,103,104,106,106,107,107,109,111,113,113,113,113,115,115,115,116,117,118,120,121,123,124,125,126,128,130,132,134,135,136,136,138,139,139,140,142,143,144,144,145,146,146,146,148,148,149,151,152,154,155,155,156,158,159,159,160,161,163,164,165,167,168,170,172,173,175,176,177,177,179,181,181,182,184,185,185,187,187,188,188,190,190,191,193,193,193,194,195,196,196,197,197,198,199,200,201,201,203,203,204,204,205,205,207,207,207,207,207,209,209,211,213,213,215,216,217,219,221,222,224,226,226,228,229,230,231,232,232,234,234,236,237,237,238,239,241,243,243,243,244,245,247,248,250,251,253,253,255,256,256,256,257,257,258,258,260,262,264,266,266,267,267,267,267,269,269,269,269,271,273,275,275,276,276,278,280,280,280,282,284,285,287,288,290,292,293,293,294,295,297,299,300,302,302,304,306,307,308,310,312,313,314,314,316,318,319,319,320,322,322,323,323,323,324,326,326,326,327,327,329,330,332,332,332,334,335,335,336,337]
    a = 331
    print(upstairs.findMagicIndex(m, a))